### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # google_storage_bucket_object.providers["2-networking"] will be created
  + resource "google_storage_bucket_object" "providers" {
      + bucket         = "isc-v1-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "providers/2-networking-providers.tf"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.providers["2-security"] will be created
  + resource "google_storage_bucket_object" "providers" {
      + bucket         = "isc-v1-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "providers/2-security-providers.tf"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.tfvars will be created
  + resource "google_storage_bucket_object" "tfvars" {
      + bucket         = "isc-v1-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "tfvars/1-resman.auto.tfvars.json"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.branch-network-dev-folder.google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Development"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.branch-network-dev-folder.google_folder_iam_binding.authoritative["organizations/626399436039/roles/serviceProjectNetworkAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag   = (known after apply)
      + folder = (known after apply)
      + id     = (known after apply)
      + role   = "organizations/626399436039/roles/serviceProjectNetworkAdmin"
    }

  # module.branch-network-dev-folder.google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = (known after apply)
    }

  # module.branch-network-folder.google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Networking"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/626399436039"
    }

  # module.branch-network-folder.google_folder_iam_binding.authoritative["roles/compute.xpnAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/compute.xpnAdmin"
    }

  # module.branch-network-folder.google_folder_iam_binding.authoritative["roles/editor"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:gcp-network-admins@bersilius.me",
        ]
      + role    = "roles/editor"
    }

  # module.branch-network-folder.google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.branch-network-folder.google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.branch-network-folder.google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.branch-network-folder.google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.branch-network-folder.google_tags_tag_binding.binding["context"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = (known after apply)
    }

  # module.branch-network-gcs.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EU"
      + name                        = "isc-v1-prod-resman-net-0"
      + project                     = "isc-v1-prod-iac-core-0"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "MULTI_REGIONAL"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.branch-network-gcs.google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_binding" "bindings" {
      + bucket  = "isc-v1-prod-resman-net-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.branch-network-prod-folder.google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Production"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.branch-network-prod-folder.google_folder_iam_binding.authoritative["organizations/626399436039/roles/serviceProjectNetworkAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag   = (known after apply)
      + folder = (known after apply)
      + id     = (known after apply)
      + role   = "organizations/626399436039/roles/serviceProjectNetworkAdmin"
    }

  # module.branch-network-prod-folder.google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = (known after apply)
    }

  # module.branch-network-sa.google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "isc-v1-prod-resman-net-0"
      + disabled     = false
      + display_name = "Terraform resman networking service account."
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "isc-v1-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.branch-network-sa.google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "authoritative" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.branch-network-sa.google_storage_bucket_iam_member.bucket-roles["isc-v1-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_member" "bucket-roles" {
      + bucket = "isc-v1-prod-iac-core-outputs-0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.branch-security-folder.google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Security"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/626399436039"
    }

  # module.branch-security-folder.google_folder_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-security-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/logging.admin"
    }

  # module.branch-security-folder.google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-security-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.branch-security-folder.google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-security-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.branch-security-folder.google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-security-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.branch-security-folder.google_folder_iam_binding.authoritative["roles/viewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:gcp-security-admins@bersilius.me",
        ]
      + role    = "roles/viewer"
    }

  # module.branch-security-folder.google_tags_tag_binding.binding["context"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = (known after apply)
    }

  # module.branch-security-gcs.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EU"
      + name                        = "isc-v1-prod-resman-sec-0"
      + project                     = "isc-v1-prod-iac-core-0"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "MULTI_REGIONAL"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.branch-security-gcs.google_storage_bucket_iam_binding.bindings["roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_binding" "bindings" {
      + bucket  = "isc-v1-prod-resman-sec-0"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:isc-v1-security-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.branch-security-sa.google_project_iam_member.project-roles["isc-v1-prod-iac-core-0-roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "isc-v1-prod-iac-core-0"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.branch-security-sa.google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "isc-v1-security-0"
      + disabled     = false
      + display_name = "Terraform resman security service account."
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "isc-v1-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.branch-security-sa.google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_binding" "authoritative" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.branch-security-sa.google_storage_bucket_iam_member.bucket-roles["isc-v1-prod-iac-core-outputs-0-roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_member" "bucket-roles" {
      + bucket = "isc-v1-prod-iac-core-outputs-0"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.organization.google_org_policy_policy.default["compute.disableGuestAttributesAccess"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/compute.disableGuestAttributesAccess"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + enforce = "TRUE"
            }
        }
    }

  # module.organization.google_org_policy_policy.default["compute.requireOsLogin"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/compute.requireOsLogin"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + enforce = "TRUE"
            }
        }
    }

  # module.organization.google_org_policy_policy.default["compute.restrictLoadBalancerCreationForTypes"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/compute.restrictLoadBalancerCreationForTypes"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + values {
                  + allowed_values = [
                      + "in:INTERNAL",
                    ]
                }
            }
        }
    }

  # module.organization.google_org_policy_policy.default["compute.skipDefaultNetworkCreation"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/compute.skipDefaultNetworkCreation"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + enforce = "TRUE"
            }
        }
    }

  # module.organization.google_org_policy_policy.default["compute.vmExternalIpAccess"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/compute.vmExternalIpAccess"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + deny_all = "TRUE"
            }
        }
    }

  # module.organization.google_org_policy_policy.default["iam.allowedPolicyMemberDomains"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/iam.allowedPolicyMemberDomains"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + condition {
                  + expression = "!resource.matchTag('626399436039/org-policies', 'allowed-policy-member-domains-all')"
                }
              + values {
                  + allowed_values = [
                      + "C02cmj95o",
                    ]
                }
            }
          + rules {
              + allow_all = "TRUE"

              + condition {
                  + expression = "resource.matchTag('626399436039/org-policies', 'allowed-policy-member-domains-all')"
                  + title      = "allow-all"
                }
            }
        }
    }

  # module.organization.google_org_policy_policy.default["iam.automaticIamGrantsForDefaultServiceAccounts"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/iam.automaticIamGrantsForDefaultServiceAccounts"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + enforce = "TRUE"
            }
        }
    }

  # module.organization.google_org_policy_policy.default["iam.disableServiceAccountKeyCreation"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/iam.disableServiceAccountKeyCreation"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + enforce = "TRUE"
            }
        }
    }

  # module.organization.google_org_policy_policy.default["iam.disableServiceAccountKeyUpload"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/iam.disableServiceAccountKeyUpload"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + enforce = "TRUE"
            }
        }
    }

  # module.organization.google_org_policy_policy.default["run.allowedIngress"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/run.allowedIngress"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + values {
                  + allowed_values = [
                      + "is:internal",
                      + "is:internal-and-cloud-load-balancing",
                    ]
                }
            }
        }
    }

  # module.organization.google_org_policy_policy.default["sql.restrictAuthorizedNetworks"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/sql.restrictAuthorizedNetworks"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + enforce = "TRUE"
            }
        }
    }

  # module.organization.google_org_policy_policy.default["sql.restrictPublicIp"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/sql.restrictPublicIp"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + enforce = "TRUE"
            }
        }
    }

  # module.organization.google_org_policy_policy.default["storage.uniformBucketLevelAccess"] will be created
  + resource "google_org_policy_policy" "default" {
      + id     = (known after apply)
      + name   = "organizations/626399436039/policies/storage.uniformBucketLevelAccess"
      + parent = "organizations/626399436039"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + enforce = "TRUE"
            }
        }
    }

  # module.organization.google_organization_iam_member.bindings["sa_net_billing"] will be created
  + resource "google_organization_iam_member" "bindings" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com"
      + org_id = "626399436039"
      + role   = "roles/billing.user"
    }

  # module.organization.google_organization_iam_member.bindings["sa_net_fw_policy_admin"] will be created
  + resource "google_organization_iam_member" "bindings" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com"
      + org_id = "626399436039"
      + role   = "roles/compute.orgFirewallPolicyAdmin"
    }

  # module.organization.google_organization_iam_member.bindings["sa_net_xpn_admin"] will be created
  + resource "google_organization_iam_member" "bindings" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com"
      + org_id = "626399436039"
      + role   = "roles/compute.xpnAdmin"
    }

  # module.organization.google_organization_iam_member.bindings["sa_sec_billing"] will be created
  + resource "google_organization_iam_member" "bindings" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:isc-v1-security-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com"
      + org_id = "626399436039"
      + role   = "roles/billing.user"
    }

  # module.organization.google_organization_iam_member.bindings["sa_sec_vpcsc_admin"] will be created
  + resource "google_organization_iam_member" "bindings" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:isc-v1-security-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com"
      + org_id = "626399436039"
      + role   = "roles/accesscontextmanager.policyAdmin"
    }

  # module.organization.google_tags_tag_key.default["context"] will be created
  + resource "google_tags_tag_key" "default" {
      + create_time     = (known after apply)
      + description     = "Resource management context."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = "organizations/626399436039"
      + short_name      = "context"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_key.default["environment"] will be created
  + resource "google_tags_tag_key" "default" {
      + create_time     = (known after apply)
      + description     = "Environment definition."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = "organizations/626399436039"
      + short_name      = "environment"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_key.default["org-policies"] will be created
  + resource "google_tags_tag_key" "default" {
      + create_time     = (known after apply)
      + description     = "Organization policy conditions."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = "organizations/626399436039"
      + short_name      = "org-policies"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_key.default["tenant"] will be created
  + resource "google_tags_tag_key" "default" {
      + create_time     = (known after apply)
      + description     = "Organization tenant."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = "organizations/626399436039"
      + short_name      = "tenant"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["context/data"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "data"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["context/gke"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "gke"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["context/networking"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "networking"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["context/sandbox"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "sandbox"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["context/security"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "security"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["context/teams"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "teams"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["context/tenant"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "tenant"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["environment/development"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "development"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["environment/production"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "production"
      + update_time     = (known after apply)
    }

  # module.organization.google_tags_tag_value.default["org-policies/allowed-policy-member-domains-all"] will be created
  + resource "google_tags_tag_value" "default" {
      + create_time     = (known after apply)
      + description     = "Managed by the Terraform organization module."
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "allowed-policy-member-domains-all"
      + update_time     = (known after apply)
    }

  # module.tenant-tenants-folder.google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "Tenants"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/626399436039"
    }

  # module.tenant-tenants-folder.google_tags_tag_binding.binding["context"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = (known after apply)
    }

Plan: 69 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cicd_repositories      = {}
  + dataplatform           = {}
  + gke_multitenant        = {}
  + networking             = {
      + folder          = (known after apply)
      + gcs_bucket      = "isc-v1-prod-resman-net-0"
      + service_account = "serviceAccount:isc-v1-prod-resman-net-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com"
    }
  + project_factories      = {}
  + providers              = (sensitive value)
  + security               = {
      + folder          = (known after apply)
      + gcs_bucket      = "isc-v1-prod-resman-sec-0"
      + service_account = "serviceAccount:isc-v1-security-0@isc-v1-prod-iac-core-0.iam.gserviceaccount.com"
    }
  + team_cicd_repositories = {}
  + teams                  = {}
  + tfvars                 = (sensitive value)

Warning: Value for undeclared variable

The root module does not declare a variable named "logging" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "environment" but a value

To silence these warnings, use TF_VAR_... environment variables to provide


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `skipped`

*Pusher: @bersilius, Action: `pull_request`, Working Directory: ``, Workflow: `GCP Organization resman stage`*